/***
==========================================================================================
 PLEASE CAREFULLY READ ALL NOTES:
------------------------------------------------------------------------------------------
 Contact Jason immediately if you have any questions, via Kik, email, or telephone.
 
 Kik: ocodo
 email: what.is.ocodo@gmail.com
 phone: +61(0)409307977

 Skype: (message me first on another mode)
 jasonm23

 Googletalk/G+: 
 jasonm23@gmail.com

------------------------------------------------------------------------------------------
==========================================================================================
Notes on the Instruction Overlays:

Press the Title Bar (says: ArcConstrukt ) to view Instructions
Overlays Each toolbar mode has a separate overlay, they will be
displayed automatically the first time the user selects a toolbar
mode.

To select each mode, press the selector at the bottom right, each one
is a different tool mode. From left to right:

    Edit  |   Color  |   Order

==========================================================================================

Not all text is for the Instructions overlay, many of these
translations are for Buttons and messages spread throughout the
Application, if you want to locate an item in the App, for example, to
see context, contact Jason if you can't find it.

------------------------------------------------------------------------------------------
Notes on text length / size
------------------------------------------------------------------------------------------
All text is expected to remain a similar length, however this may not
be possible in some circumstances.

Ideally, figure out all text translations first, and try to maintain
same length, if you cannot, please make a note next to the translation
like so:

"English original text" = "Texto original en Inglés" //LONG

^ This translation is longer than the original, so "//LONG" is placed
after it, always just use "//LONG". Jason will be in touch if
necessary.
==========================================================================================
**/


// Translations Begin below this line
// --- 8< --------------------------------------------------------------------------------

/* 
Info for the Color Instructions overlay
Be wary of the text box size, it must be respected.
*/

// Translations all follow this pattern: 

// English Language verson:  ----------------------------------------------------------------------------    =  Your translated version. - Proper nouns can be left in English as appropriate

"* Import Color Palette from the Action Menu, (up to 6 hex colors will be found in text from the Clipboard)" = "* สีนำเข้าจากคลิปบอร์ด, (คัดลอกสี Hex บางลงในคลิปบอร์ด ArcConstrukt จะค้นหาและใช้ครั้งแรก 6)";


/* Title for main Action Menu in all Instruction overlays, see top note for viewing Instructions overlay */
"Action Menu" = "เมนูการกระทำ";


/* Note for Action menu visible on the Color Instruction overlay */
"Action Menu:\nSave PNG to\nCamera Roll,\nImport Color Palette*,\nSave ArcMachine,\nMy ArcMachines\n(+Email & Dropbox sharing)" = "เมนูการกระทำ:\nบันทึก PNG ม้วนฟิล์ม\nสีนำเข้า*\nบันทึก ArcMachine\nเรา ArcMachines\n(อีเมล์ & Dropbox ร่วมกัน)";

/* Note for add Arc, visible on all Instruction overlays. */
"Add Arc" = "เพิ่มส่วนโค้ง";

/* Message displayed when ArcMachine & SVG are uploaded to Dropbox. */
"ArcMachine and SVG uploaded to Dropbox" = "ArcMachine และ SVG อัปโหลดไปยัง Dropbox";

/* Angle A. This should remain English. */
"A˚" = "A˚";

/* Angle B. This should remain English. */
"B˚" = "B˚";

/* Layer Order Instructions Overlay. */
"Back One" = "ย้อนกลับ";

/* Cancel label for all cancel buttons in the App. */
"Cancel" = "ยกเลิก";

/* Title for Action Menu. */
"Choose an Action" = "เลือกการกระทำ";

/* Clear All - Quick Edit menu label. */
"Clear All" = "เช็ด";

/* Clone - Quick Edit menu label. */
"Clone" = "ซ้ำ";

/* Color - mode selector label Instructions Overlay (all modes, at the bottom) */
"Color" = "สี";

/* Message displayed when exporting colors to clipboard */
"Color Palette exported to the Clipboard" = "สีส่งออก";

/* No comment provided by engineer. */
"Color Palette: Touch to pick a color, Long touch to edit a color" = "จานสี: กดเพ​​ื่อเลือกสี / สัมผัสลองแก้ไขสี";

/* No comment provided by engineer. */
"Copy some Hex colors into the clipboard, ArcConstrukt will find and use the first 6" = "คัดลอกสี Hex บางลงในคลิปบอร์ด ArcConstrukt จะค้นหาและใช้ครั้งแรก 6";

/* No comment provided by engineer. */
"Delete" = "ลบ";

/* No comment provided by engineer. */
"Deleted" = "ลบ";

/* No comment provided by engineer. */
"Deselect" = "ยกเลิกการเลือก";

/* Edit - mode selector label Instructions Overlay (all modes, at the bottom) */
"Edit" = "แก้ไข";

/* Email cancelled feedback message. */
"Email Cancelled" = "อีเมล์ ยกเลิก";

/* Email failed feedback message. */
"Email Failed" = "อีเมล์ ล้มเหลว";

/* Email not sent feedback message. */
"Email Not Sent" = "อีเมล์ ไม่ได้ส่ง";

/* Email saved feedback message. */
"Email Saved" = "อีเมล์ บันทึก";

/* Email sent feedback message. */
"Email Sent" = "อีเมล์ ส่ง";

/* Action Menu lable for Export Color Palette. */
"Export Colors" = "สีส่งออก";

/* Message for delete failure. */
"Failed to delete" = "ล้มเหลวที่จะลบ";

/* Message for file loading fail. */
"Failed to load %@" = "ไม่สามารถโหลด %@";

/* Color Mode Instructions Overlay Label. */
"Fill" = "ใส่";

/* Edit Mode Instructions Overlay Label. */
"Finger Rotate" = "นิ้วหมุน";

/* Order mode Instructions Overlay label for bring layer forwards */
"Forwards" = "ข้างหน้า";

/* Instructions Overlay label for Grid. */
"Grid" = "ตะแกรง";

/* Action Menu Label for Import Colors. */
"Import Colors" = "สีนำเข้า";

/* Message displayed when color palette is imported. the %i is a place holder for the number of colors, e.g. "%i Colors Imported" would read "6 Colors Imported" - contact Jason if in doubt.*/
"Imported %i colors from the Clipboard" = "%i สีที่นำมาจากคลิปบอร์ด";

/* Label title for Order instructions overlay. */
"Layer Ordering" = "ลำดับชั้น";

/* Linked label - Edit mode Instructions Overlay. Describes that angle A and B are linked when using the Linked rotate mode, could be replaced by Rotate, if the translation would be clearer. */
"Linked" = "เชื่อมโยง";

/* Loaded - for loaded file message */
"Loaded" = "เต็ม";

/* Lock label - Edit mode Instructions Overlay. */
"Lock" = "ล็อค";

/* Memory warning alert message. */
"Memory warning: Save your work, just in case!" = "เตือนความจำ: บันทึกงานของคุณเพียงแค่ในกรณีที่!";

/* Action Menu Button title for My ArcMachines. - only translate "My" ArcMachines is a trademark, so it should appear in all lanuguages */
"My ArcMachines" = "เรา ArcMachines";

/* Share email, subject line. */
"My Shiny New ArcMachine" = "เงาใหม่ของฉัน ArcMachine";

/* Default text to be show in "My ArcMachines" when none are saved. */
"No ArcMachines saved yet" = "ยัง ไม่ บันทึก ArcMachines";

/* Order - mode selector label Instructions Overlay (all modes, at the bottom) */
"Order" = "สั่ง";

/* Color Mode Instructions Overlay Label for shape outline. */
"Outline" = "เค้าโครง";

/* quick edit menu label for Paste. */
"Paste" = "วาง";

/* Edit mode instructions overlay label for Pinch. */
"Pinch" = "หยิก";

/* Do not translate. */
"PNG 1280x1280" = "PNG 1280x1280";

/* Do not translate. */
"PNG 1920x1920" = "PNG 1920x1920";

/* Do not translate. */
"PNG 2560x2560" = "PNG 2560x2560";

/* Do not translate. */
"PNG 2880x2880" = "PNG 2880x2880";

/* Do not translate. */
"PNG 3200x3200" = "PNG 3200x3200";

/* Do not translate. */
"PNG 640x640" = "PNG 640x640";

/* + refers to the + icon at top left, so it must remain in the translation*/
"Press + to add Arcs" = "สัมผัส + เพื่อเพิ่มส่วนโค้ง";

/* Instructions overlay label for Title bar */
"Press Title for this page, Swipe Title to watch the video tour" = "กดหัวข้อสำหรับหน้าเว็บนี้ หัวข้อกวาดเพื่อดูวีดีโอทัวร์";

/* Translate to the first letter of translation of Radius. (lower case where applicable) */
"r" = "ร";

/* Edit mode Instructions overlay label for Radius pinching. */
"Radius" = "รัศมี";

/* Edit mode Instructions overlay label for Removing/Deleting the selected Arc. */
"Remove Arc" = "ลบโค้ง";

/* Action Menu Button label for Saving ArcMachine - only translate "Save" ArcMachines should remain in all translations. */
"Save ArcMachine" = "บันทึก ArcMachine";

/* Saving ArcMachine message. */
"Saving ArcMachine" = "บันทึก ArcMachine";

/* Action Menu Button label. */
"Save PNG to Camera Roll" = "บันทึก PNG ม้วนฟิล์ม";

/* Title for image size/quality menu - \n means linebreak, please keep it in the translation. */
"Save to Camera Roll\nImage Quality" = "บันทึก PNG ม้วนฟิล์ม\nคุณภาพของภาพ";

/* Message for successful PNG image save. */
"Saved PNG" = "บันทึก PNG";

/* Instructions overlay label for the up down select arc buttons. */
"Select Arc" = "เลือกโค้ง";

/* Files view Share as Email menu button label. */
"Share as Email" = "แบ่งปันไปอีเมล์";

/* Files view Share to Dropbox menu button label. Dropbox is a trademark, don't translate it, just translate "Share to" ie. "に共有 Dropbox" or "Partager sur Dropbox" etc. */
"Share to Dropbox" = "แบ่งปันไป Dropbox";

/* Translate to the first letter for the word Thickness in the target language. e.g. "G" in French, (for Grosseur) For idographic languages, e.g. Japanese, approximate ie. 厚 thick (atsu) */
"T" = "ห";

/* Help prompt for Files view ("My ArcMachines")*/
"Tap once to Load, Hold to Share or Delete" = "แตะหนึ่งครั้งเพื่อโหลด / กดยาวสำหรับตัวเลือก";

/* Message for photo saving problems. */
"There was a problem saving your image, check photo album privacy settings, and make sure you have enough free memory." = "มีปัญหาในการบันทึกภาพของคุณ ให้ตรวจสอบภาพการตั้งค่าส่วนตัวอัลบั้มและ ให้แน่ใจว่าคุณมีหน่วยความจำเพียงพอ";

/* Edit mode Instructions Overlay label for Thickness of arc. */
"Thickness" = "หนา";

/* Order mode Instructions Overlay label. */
"To Back" = "กลับ";

/* Order mode Instructions Overlay label. */
"To Front" = "ด้านหน้า";

/* all mode Instructions Overlay label. */
"Tools Selector" = "เลือกเครื่องมือ";

/* all mode Instructions Overlay label. */
"Touch Hold drawing area for quick edit menu" = "สัมผัสถือพื้นที่วาด สำหรับเมนูแก้ไขอย่างรวดเร็ว";

/* Color mode Instructions Overlay label. */
"Transparency" = "ความโปร่งใส";

